<a href="https://colab.research.google.com/github/SREYAKUKUTAPU/Pyspark/blob/main/joins.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
from pyspark.sql import SparkSession, Row
from pyspark.sql.types import *
from pyspark.sql.functions import *
spark = SparkSession.builder.appName("show").getOrCreate()

In [3]:
# Define schema for Employees DataFrame
employee_schema = StructType([
    StructField("emp_id", IntegerType(), True),
    StructField("emp_name", StringType(), True),
    StructField("dept_id", IntegerType(), True),
    StructField("salary", IntegerType(), True)
])

# Define schema for Departments DataFrame
department_schema = StructType([
    StructField("dept_id", IntegerType(), True),
    StructField("dept_name", StringType(), True),
    StructField("location", StringType(), True)
])

# Sample data for employees
employee_data = [
    (1, "Alice", 10, 60000),
    (2, "Bob", 20, 55000),
    (3, "Charlie", 10, 65000),
    (4, "Dave", 30, 70000),
    (5, "Eve", 20, 45000),
    (6, "Ev", 40, 45000)
]

# Sample data for departments
department_data = [
    (10, "HR", "New York"),
    (20, "IT", "San Francisco"),
    (30, "Marketing", "Chicago"),
    (50, "Sales", "Los Angeles")
]

# Create DataFrames from the data
employee_df = spark.createDataFrame(employee_data, employee_schema)
department_df = spark.createDataFrame(department_data, department_schema)

# Show the DataFrames (optional)
employee_df.show()
department_df.show()

+------+--------+-------+------+
|emp_id|emp_name|dept_id|salary|
+------+--------+-------+------+
|     1|   Alice|     10| 60000|
|     2|     Bob|     20| 55000|
|     3| Charlie|     10| 65000|
|     4|    Dave|     30| 70000|
|     5|     Eve|     20| 45000|
|     6|      Ev|     40| 45000|
+------+--------+-------+------+

+-------+---------+-------------+
|dept_id|dept_name|     location|
+-------+---------+-------------+
|     10|       HR|     New York|
|     20|       IT|San Francisco|
|     30|Marketing|      Chicago|
|     50|    Sales|  Los Angeles|
+-------+---------+-------------+

In [4]:
employee_df.join(department_df, employee_df.dept_id == department_df.dept_id, "inner").show()

+------+--------+-------+------+-------+---------+-------------+
|emp_id|emp_name|dept_id|salary|dept_id|dept_name|     location|
+------+--------+-------+------+-------+---------+-------------+
|     1|   Alice|     10| 60000|     10|       HR|     New York|
|     3| Charlie|     10| 65000|     10|       HR|     New York|
|     2|     Bob|     20| 55000|     20|       IT|San Francisco|
|     5|     Eve|     20| 45000|     20|       IT|San Francisco|
|     4|    Dave|     30| 70000|     30|Marketing|      Chicago|
+------+--------+-------+------+-------+---------+-------------+

In [5]:
employee_df.join(department_df,employee_df.dept_id==department_df.dept_id,'left').show()

+------+--------+-------+------+-------+---------+-------------+
|emp_id|emp_name|dept_id|salary|dept_id|dept_name|     location|
+------+--------+-------+------+-------+---------+-------------+
|     2|     Bob|     20| 55000|     20|       IT|San Francisco|
|     1|   Alice|     10| 60000|     10|       HR|     New York|
|     3| Charlie|     10| 65000|     10|       HR|     New York|
|     5|     Eve|     20| 45000|     20|       IT|San Francisco|
|     6|      Ev|     40| 45000|   NULL|     NULL|         NULL|
|     4|    Dave|     30| 70000|     30|Marketing|      Chicago|
+------+--------+-------+------+-------+---------+-------------+

In [6]:
employee_df.join(department_df,employee_df.dept_id==department_df.dept_id,'right').show()

+------+--------+-------+------+-------+---------+-------------+
|emp_id|emp_name|dept_id|salary|dept_id|dept_name|     location|
+------+--------+-------+------+-------+---------+-------------+
|     5|     Eve|     20| 45000|     20|       IT|San Francisco|
|     2|     Bob|     20| 55000|     20|       IT|San Francisco|
|     3| Charlie|     10| 65000|     10|       HR|     New York|
|     1|   Alice|     10| 60000|     10|       HR|     New York|
|  NULL|    NULL|   NULL|  NULL|     50|    Sales|  Los Angeles|
|     4|    Dave|     30| 70000|     30|Marketing|      Chicago|
+------+--------+-------+------+-------+---------+-------------+

In [7]:
employee_df.join(department_df,employee_df.dept_id==department_df.dept_id,'full').show()

+------+--------+-------+------+-------+---------+-------------+
|emp_id|emp_name|dept_id|salary|dept_id|dept_name|     location|
+------+--------+-------+------+-------+---------+-------------+
|     1|   Alice|     10| 60000|     10|       HR|     New York|
|     3| Charlie|     10| 65000|     10|       HR|     New York|
|     2|     Bob|     20| 55000|     20|       IT|San Francisco|
|     5|     Eve|     20| 45000|     20|       IT|San Francisco|
|     4|    Dave|     30| 70000|     30|Marketing|      Chicago|
|     6|      Ev|     40| 45000|   NULL|     NULL|         NULL|
|  NULL|    NULL|   NULL|  NULL|     50|    Sales|  Los Angeles|
+------+--------+-------+------+-------+---------+-------------+

In [8]:
employee_df.join(department_df,employee_df.dept_id==department_df.dept_id,'leftsemi').show()

+------+--------+-------+------+
|emp_id|emp_name|dept_id|salary|
+------+--------+-------+------+
|     1|   Alice|     10| 60000|
|     3| Charlie|     10| 65000|
|     2|     Bob|     20| 55000|
|     5|     Eve|     20| 45000|
|     4|    Dave|     30| 70000|
+------+--------+-------+------+

In [9]:
employee_df.join(department_df,employee_df.dept_id==department_df.dept_id,'leftanti').show()

+------+--------+-------+------+
|emp_id|emp_name|dept_id|salary|
+------+--------+-------+------+
|     6|      Ev|     40| 45000|
+------+--------+-------+------+

In [18]:
data3=[(1,'Alex',0),(2,'John',1),(3,'David',2)]
schema3=['id','name','managerId']
df=spark.createDataFrame(data=data3,schema=schema3)
df.show()

+---+-----+---------+
| id| name|managerId|
+---+-----+---------+
|  1| Alex|        0|
|  2| John|        1|
|  3|David|        2|
+---+-----+---------+

In [20]:
df1=df.alias('employee').join(df.alias('manager'),col('employee.managerId')==col('manager.id'),'left').select(col('employee.id').alias('employeeID'),col('employee.name').alias('employeeName'),col('manager.name').alias('manager_name'))
df1.show()

+----------+------------+------------+
|employeeID|employeeName|manager_name|
+----------+------------+------------+
|         1|        Alex|        NULL|
|         2|        John|        Alex|
|         3|       David|        John|
+----------+------------+------------+